app/controllers/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT "boards".* FROM "boards"

  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("content", "titles", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "대박"], ["titles", "안녕"], ["created_at", "2024-03-14 09:37:44.402026"], ["updated_at", "2024-03-14 09:37:44.402026"]]

  def destroy
    @board.destroy
---
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 1]]

    def set_board
      @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]