app/controllers/home_controller.rb

	def create
		# 정보를 저장하는 코드
		post = Post.new
		post.title = params[:title]
		post.content = params[:content]
		post.save

		redirect_to '/index'

	end

# 	수정
	def	modify
		@post = Post.find(params[:post_id])
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "안녕"], ["content", "제발"], ["created_at", "2024-03-10 11:15:08.311847"], ["updated_at", "2024-03-10 11:15:08.311847"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		post = Post.find(params[:post_id])
		post.title = params[:title]
		post.content = params[:content]
		post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ddddddddd"], ["content", "dddddddd"], ["updated_at", "2024-03-13 14:29:10.072641"], ["id", 1]]

	def delete
		Post.destroy(params[:post_id])
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]